app/controllers/admin/orders_controller.rb

  def index
    @orders = Order.order("id DESC")
---
SELECT "orders".* FROM "orders" ORDER BY id DESC

  def ship
    @order = Order.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

  def cancel
    @order = Order.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]