app/controllers/admin/products_controller.rb

  def update
    @product = Product.find(params[:id])

    if @product.update(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "image" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["image", "屏幕快照_2017-08-24_上午3.32.58.png"], ["updated_at", 2017-09-10 07:05:32 UTC], ["id", 1]]

  def create
    @product = Product.new(product_params)

    if @product.save
---
INSERT INTO "products" ("title", "description", "quantity", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "天龙八部"], ["description", "金老爷子出品"], ["quantity", 6], ["price", 15], ["created_at", 2017-09-10 06:18:25 UTC], ["updated_at", 2017-09-10 06:18:25 UTC]]