app/views/carts/index.html.erb


        <% current_cart.cart_items.each do |cart_item| %>
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 1]]

              <%= link_to product_path(cart_item.product) do %>
                <% if cart_item.product.image.present? %>
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]