app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)
    @order.user = current_user
    @order.total = current_cart.total_price

    if @order.save

      current_cart.cart_items.each do |cart_item|
        product_list = ProductList.new
        product_list.order = @order
        product_list.product_name = cart_item.product.title
        product_list.product_price = cart_item.product.price
        product_list.quantity = cart_item.quantity
        product_list.save
---
INSERT INTO "orders" ("total", "user_id", "billing_name", "billing_address", "shipping_name", "shipping_address", "created_at", "updated_at", "token") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 1]]
SELECT "product_lists".* FROM "product_lists" WHERE "product_lists"."order_id" = ?  [["order_id", 5]]
INSERT INTO "product_lists" ("order_id", "product_name", "product_price", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["order_id", 3], ["product_name", "欢迎来到实力至上主义教室"], ["product_price", 3330], ["quantity", 4], ["created_at", 2017-09-12 11:28:52 UTC], ["updated_at", 2017-09-12 11:28:52 UTC]]

  def show
    @order =Order.find_by_token(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."token" = ? LIMIT ?  [["token", "0d908bea-90d5-4f29-bbce-d81822f3f286"], ["LIMIT", 1]]

  def pay_with_alipay
    @order = Order.find_by_token(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."token" = ? LIMIT ?  [["token", "0d908bea-90d5-4f29-bbce-d81822f3f286"], ["LIMIT", 1]]

  def pay_with_wechat
    @order = Order.find_by_token(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."token" = ? LIMIT ?  [["token", "b2104ce9-d0f5-41e9-893c-56d888d51247"], ["LIMIT", 1]]

  def apply_to_cancel
    @order =Order.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]